Тестовая_база_ERP_14/src/DataProcessors/АГ_ФормированиеФинансовыхДокументов/АГ_ФормированиеФинансовыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АГ_ФормированиеФинансовыхДокументов</name>
  <comment>АГ:[УСЛ0017][11.05.2019 18:05][Давиденко А.В.]</comment>
</mdclass:DataProcessor>

Тестовая_база_ERP_14/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/AccumulationRegisters/ТоварыКПоступлению/ТоварыКПоступлению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКПоступлению</name>
  <resources>
    <name>КОформлениюНакладныхПоРаспоряжению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюПоступленийПоРаспоряжению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюПоступленийПоНакладным</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюПоступленийПоОрдерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюОрдеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принимается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DefinedType.РаспоряжениеНаПоступление</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/Enums/СтатусыРеализацийТоваровУслуг/СтатусыРеализацийТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРеализацийТоваровУслуг</name>
  <enumValues>
    <name>КПредоплате</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/DataProcessors/АГ_ФормированиеФинансовыхДокументов/ObjectModule.bsl
//<--АГ:[УСЛ0017][11.05.2019 18:05][Давиденко А.В.]
Процедура ОбработатьЗаказыКлиента(ДокументОтгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток,
		|	ТоварыКОтгрузкеОстатки.КОформлениюОстаток КАК КОформлениюОстаток,
		|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
		|	ТоварыКОтгрузкеОстатки.Серия КАК Серия
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
		|ГДЕ
		|	ТоварыКОтгрузкеОстатки.КОформлениюОстаток > ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
		|	И ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента)
		|	И ТоварыКОтгрузкеОстатки.ДокументОтгрузки = &ДокументОтгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
		|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
		|	МАКСИМУМ(ЗаказКлиентаТовары.Цена) КАК Цена,
		|	СУММА(ЗаказКлиентаТовары.Сумма) КАК Сумма,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ЗаказКлиентаТовары.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ЗаказКлиентаТовары.СуммаСНДС) КАК СуммаСНДС,
		|	ЗаказКлиентаТовары.Склад КАК Склад,
		|	ЗаказКлиентаТовары.Содержание КАК Содержание,
		|	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
		|	СУММА(ЗаказКлиентаТовары.АГ_КоличествоШтук) КАК АГ_КоличествоШтук,
		|	ЗаказКлиентаТовары.АГ_ТипЗапасов КАК АГ_ТипЗапасов,
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки
		|ПОМЕСТИТЬ втСтроки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				втЗаказы.ДокументОтгрузки КАК ДокументОтгрузки
		|			ИЗ
		|				втЗаказы КАК втЗаказы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Упаковка,
		|	ЗаказКлиентаТовары.ВидЦены,
		|	ЗаказКлиентаТовары.СтавкаНДС,
		|	ЗаказКлиентаТовары.Склад,
		|	ЗаказКлиентаТовары.Характеристика,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.АГ_ТипЗапасов,
		|	ЗаказКлиентаТовары.Серия,
		|	ЗаказКлиентаТовары.Ссылка,
		|	ЗаказКлиентаТовары.ВариантОбеспечения,
		|	ЗаказКлиентаТовары.Содержание,
		|	ЗаказКлиентаТовары.НоменклатураНабора,
		|	ЗаказКлиентаТовары.СтатусУказанияСерий,
		|	ЗаказКлиентаТовары.КодСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСтроки.Номенклатура КАК Номенклатура,
		|	втСтроки.Характеристика КАК Характеристика,
		|	втСтроки.Упаковка КАК Упаковка,
		|	втСтроки.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втСтроки.Количество КАК Количество,
		|	втСтроки.ВидЦены КАК ВидЦены,
		|	втСтроки.Цена КАК Цена,
		|	втСтроки.Сумма КАК Сумма,
		|	втСтроки.СтавкаНДС КАК СтавкаНДС,
		|	втСтроки.СуммаНДС КАК СуммаНДС,
		|	втСтроки.СуммаСНДС КАК СуммаСНДС,
		|	втСтроки.Склад КАК Склад,
		|	втСтроки.Содержание КАК Содержание,
		|	втСтроки.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	втСтроки.ВариантОбеспечения КАК ВариантОбеспечения,
		|	втСтроки.Серия КАК Серия,
		|	втСтроки.НоменклатураНабора КАК НоменклатураНабора,
		|	втСтроки.АГ_КоличествоШтук КАК АГ_КоличествоШтук,
		|	втСтроки.АГ_ТипЗапасов КАК АГ_ТипЗапасов,
		|	втСтроки.Ссылка КАК Ссылка,
		|	втЗаказы.КОтгрузкеОстаток КАК КОтгрузке,
		|	втЗаказы.КОформлениюОстаток КАК КОформлению,
		|	втСтроки.КодСтроки КАК КодСтроки
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтроки КАК втСтроки
		|		ПО втЗаказы.ДокументОтгрузки = втСтроки.Ссылка
		|			И втЗаказы.Номенклатура = втСтроки.Номенклатура
		|			И втЗаказы.Характеристика = втСтроки.Характеристика
		|			И втЗаказы.Серия = втСтроки.Серия
		|ИТОГИ ПО
		|	Ссылка";
	
	
	Если ЗначениеЗаполнено(ДокументОтгрузки) Тогда
		Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументОтгрузки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТоварыКОтгрузкеОстатки.ДокументОтгрузки = &ДокументОтгрузки", "");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		НовДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(НовДок, ВыборкаЗаказ.Ссылка,,"Номер, Проведен");
		НовДок.Дата = ТекущаяДата();
		НовДок.ЗаказКлиента = ВыборкаЗаказ.Ссылка;
		НовДок.РеализацияПоЗаказам = Истина;
		НовДок.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
		НовДок.Валюта = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		НовДок.ВалютаВзаиморасчетов = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		Выборка = ВыборкаЗаказ.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтрока = НовДок.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
			НовСтрока.ЗаказКлиента = ВыборкаЗаказ.Ссылка;
			//НовСтрока.КодСтр
			
			КвоФакт = Выборка.КОформлению - Выборка.КОтгрузке;
			
			Если Не КвоФакт = НовСтрока.КоличествоУпаковок Тогда
				НовСтрока.Количество = КвоФакт;
				НовСтрока.КоличествоУпаковок = КвоФакт;
				НовСтрока.Сумма = Окр(Выборка.Сумма * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаСНДС = Окр(Выборка.СуммаСНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаНДС = Окр(Выборка.СуммаНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
			КонецЕсли;
			
		КонецЦикла;
		НовДок.Записать(РежимЗаписиДокумента.Запись);
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбработатьЗаказыПоставщика(ДокументПоступления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
		|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
		|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерамОстаток,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК КОформлениюОрдеровОстаток
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток > ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток
		|	И ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ЗаказПоставщику)
		|	И ТоварыКПоступлениюОстатки.ХозяйственнаяОперация = &ХозяйственнаяОперация
		|	И ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
		|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
		|	МАКСИМУМ(ЗаказПоставщикуТовары.Цена) КАК Цена,
		|	СУММА(ЗаказПоставщикуТовары.Сумма) КАК Сумма,
		|	ЗаказПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ЗаказПоставщикуТовары.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК СуммаСНДС,
		|	ЗаказПоставщикуТовары.СтатьяРасходов КАК СтатьяРасходов,
		|	ЗаказПоставщикуТовары.АналитикаРасходов КАК АналитикаРасходов,
		|	ЗаказПоставщикуТовары.Склад КАК Склад,
		|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
		|	ЗаказПоставщикуТовары.Подразделение КАК Подразделение,
		|	ЗаказПоставщикуТовары.СписатьНаРасходы КАК СписатьНаРасходы,
		|	ЗаказПоставщикуТовары.КодСтроки КАК КодСтроки
		|ПОМЕСТИТЬ втСтроки
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				втЗаказы.ДокументПоступления КАК ДокументПоступления
		|			ИЗ
		|				втЗаказы КАК втЗаказы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика,
		|	ЗаказПоставщикуТовары.Упаковка,
		|	ЗаказПоставщикуТовары.СтатьяРасходов,
		|	ЗаказПоставщикуТовары.АналитикаРасходов,
		|	ЗаказПоставщикуТовары.Склад,
		|	ЗаказПоставщикуТовары.Назначение,
		|	ЗаказПоставщикуТовары.Подразделение,
		|	ЗаказПоставщикуТовары.СписатьНаРасходы,
		|	ЗаказПоставщикуТовары.СтавкаНДС,
		|	ЗаказПоставщикуТовары.КодСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСтроки.Ссылка КАК Ссылка,
		|	втСтроки.Номенклатура КАК Номенклатура,
		|	втСтроки.Характеристика КАК Характеристика,
		|	втСтроки.Упаковка КАК Упаковка,
		|	втСтроки.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втСтроки.Количество КАК Количество,
		|	втСтроки.Цена КАК Цена,
		|	втСтроки.Сумма КАК Сумма,
		|	втСтроки.СтавкаНДС КАК СтавкаНДС,
		|	втСтроки.СуммаНДС КАК СуммаНДС,
		|	втСтроки.СуммаСНДС КАК СуммаСНДС,
		|	втСтроки.СтатьяРасходов КАК СтатьяРасходов,
		|	втСтроки.АналитикаРасходов КАК АналитикаРасходов,
		|	втСтроки.Склад КАК Склад,
		|	втСтроки.Назначение КАК Назначение,
		|	втСтроки.Подразделение КАК Подразделение,
		|	втСтроки.СписатьНаРасходы КАК СписатьНаРасходы,
		|	втЗаказы.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерам,
		|	втЗаказы.КОформлениюОрдеровОстаток КАК КОформлениюОрдеров,
		|	втЗаказы.Серия КАК Серия,
		|	втСтроки.КодСтроки КАК КодСтроки
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтроки КАК втСтроки
		|		ПО втЗаказы.ДокументПоступления = втСтроки.Ссылка
		|			И втЗаказы.Номенклатура = втСтроки.Номенклатура
		|			И втЗаказы.Характеристика = втСтроки.Характеристика
		|			И втЗаказы.Назначение = втСтроки.Назначение
		|			И втЗаказы.Склад = втСтроки.Склад
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
		Запрос.УстановитьПараметр("ДокументПоступления", ДокументПоступления);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления", "");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		НовДок = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(НовДок, ВыборкаЗаказ.Ссылка,,"Номер, Проведен");
		НовДок.Дата = ТекущаяДата();
		НовДок.ЗаказПоставщику = ВыборкаЗаказ.Ссылка;
		//НовДок.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
		НовДок.Валюта = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		НовДок.ВалютаВзаиморасчетов = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		НовДок.ПоступлениеПоЗаказам = Истина;
		Выборка = ВыборкаЗаказ.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтрока = НовДок.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
			НовСтрока.ЗаказПоставщику = ВыборкаЗаказ.Ссылка;
			НовСтрока.КодСтроки = 1;
			
			Если ЗначениеЗаполнено(НовСтрока.Серия) Тогда
				НовСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
			КвоФакт = Выборка.КОформлениюПоступленийПоОрдерам - Выборка.КОформлениюОрдеров;
			
			Если Не КвоФакт = НовСтрока.КоличествоУпаковок Тогда
				НовСтрока.Количество = КвоФакт;
				НовСтрока.КоличествоУпаковок = КвоФакт;
				НовСтрока.Сумма = Окр(Выборка.Сумма * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаСНДС = Окр(Выборка.СуммаСНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаНДС = Окр(Выборка.СуммаНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
			КонецЕсли;
			
		КонецЦикла;
		НовДок.Записать(РежимЗаписиДокумента.Запись);
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьЗаказыПоставщика_ТоварыВПути(ДокументПоступления)
	
		//|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток > ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток
		//|	И ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ЗаказПоставщику) Или ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ПриобретениеТоваровУслуг) 
		//|	И ТоварыКПоступлениюОстатки.ХозяйственнаяОперация = &ХозяйственнаяОперация
		//|	И ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления Или ТоварыКПоступлениюОстатки.ДокументПоступления.ЗаказПоставщику = &ДокументПоступления
	
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
		|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
		|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерамОстаток,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК КОформлениюОрдеровОстаток
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток > ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток
		|	И ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ПриобретениеТоваровУслуг) 
		|	И ТоварыКПоступлениюОстатки.ХозяйственнаяОперация = &ХозяйственнаяОперация
		|	И ТоварыКПоступлениюОстатки.ДокументПоступления.ЗаказПоставщику = &ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
		|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
		|	МАКСИМУМ(ЗаказПоставщикуТовары.Цена) КАК Цена,
		|	СУММА(ЗаказПоставщикуТовары.Сумма) КАК Сумма,
		|	ЗаказПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ЗаказПоставщикуТовары.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК СуммаСНДС,
		|	ЗаказПоставщикуТовары.СтатьяРасходов КАК СтатьяРасходов,
		|	ЗаказПоставщикуТовары.АналитикаРасходов КАК АналитикаРасходов,
		|	ЗаказПоставщикуТовары.Склад КАК Склад,
		|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
		|	ЗаказПоставщикуТовары.Подразделение КАК Подразделение,
		|	ЗаказПоставщикуТовары.СписатьНаРасходы КАК СписатьНаРасходы
		|ПОМЕСТИТЬ втСтроки
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				втЗаказы.ДокументПоступления КАК ДокументПоступления
		|			ИЗ
		|				втЗаказы КАК втЗаказы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика,
		|	ЗаказПоставщикуТовары.Упаковка,
		|	ЗаказПоставщикуТовары.СтатьяРасходов,
		|	ЗаказПоставщикуТовары.АналитикаРасходов,
		|	ЗаказПоставщикуТовары.Склад,
		|	ЗаказПоставщикуТовары.Назначение,
		|	ЗаказПоставщикуТовары.Подразделение,
		|	ЗаказПоставщикуТовары.СписатьНаРасходы,
		|	ЗаказПоставщикуТовары.СтавкаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСтроки.Ссылка КАК Ссылка,
		|	втСтроки.Номенклатура КАК Номенклатура,
		|	втСтроки.Характеристика КАК Характеристика,
		|	втСтроки.Упаковка КАК Упаковка,
		|	втСтроки.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втСтроки.Количество КАК Количество,
		|	втСтроки.Цена КАК Цена,
		|	втСтроки.Сумма КАК Сумма,
		|	втСтроки.СтавкаНДС КАК СтавкаНДС,
		|	втСтроки.СуммаНДС КАК СуммаНДС,
		|	втСтроки.СуммаСНДС КАК СуммаСНДС,
		|	втСтроки.СтатьяРасходов КАК СтатьяРасходов,
		|	втСтроки.АналитикаРасходов КАК АналитикаРасходов,
		|	втСтроки.Склад КАК Склад,
		|	втСтроки.Назначение КАК Назначение,
		|	втСтроки.Подразделение КАК Подразделение,
		|	втСтроки.СписатьНаРасходы КАК СписатьНаРасходы,
		|	втЗаказы.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерам,
		|	втЗаказы.КОформлениюОрдеровОстаток КАК КОформлениюОрдеров,
		|	втЗаказы.Серия КАК Серия
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтроки КАК втСтроки
		|		ПО втЗаказы.ДокументПоступления = втСтроки.Ссылка
		|			И втЗаказы.Номенклатура = втСтроки.Номенклатура
		|			И втЗаказы.Характеристика = втСтроки.Характеристика
		|			И втЗаказы.Назначение = втСтроки.Назначение
		|			И втЗаказы.Склад = втСтроки.Склад
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
	
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
		Запрос.УстановитьПараметр("ДокументПоступления", ДокументПоступления);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТоварыКПоступлениюОстатки.ДокументПоступления.ЗаказПоставщику = &ДокументПоступления", "");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		НовДок = Документы.ПоступлениеТоваровНаСклад.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(НовДок, ВыборкаЗаказ.Ссылка,,"Номер, Проведен");
		НовДок.Дата = ТекущаяДата();
			
		НовДок.Распоряжение = ВыборкаЗаказ.Ссылка;
		//Если ТипЗнч(ВыборкаЗаказ.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		//	НовДок.Распоряжение = ВыборкаЗаказ.Ссылка.ЗаказПоставщику;
		//КонецЕсли;	
		НовДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути;
		//НовДок.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
		НовДок.Валюта = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		НовДок.ВидДеятельностиНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	//	НовДок.ВалютаВзаиморасчетов = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		Выборка = ВыборкаЗаказ.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтрока = НовДок.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
			
			Если ЗначениеЗаполнено(НовСтрока.Серия) Тогда
				НовСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
			КвоФакт = Выборка.КОформлениюПоступленийПоОрдерам - Выборка.КОформлениюОрдеров;
			
			Если Не КвоФакт = НовСтрока.КоличествоУпаковок Тогда
				НовСтрока.Количество = КвоФакт;
				НовСтрока.КоличествоУпаковок = КвоФакт;
				НовСтрока.Сумма = Окр(Выборка.Сумма * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаСНДС = Окр(Выборка.СуммаСНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаНДС = Окр(Выборка.СуммаНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
			КонецЕсли;
			
		КонецЦикла;
		НовДок.Записать(РежимЗаписиДокумента.Запись);
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьЗаказыПоставщика_Хранение(ДокументПоступления)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
		|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
		|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерамОстаток,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК КОформлениюОрдеровОстаток
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток > ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток
		|	И ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ЗаказПоставщику)
		|	И ТоварыКПоступлениюОстатки.ХозяйственнаяОперация = &ХозяйственнаяОперация
		|	И ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
		|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
		|	МАКСИМУМ(ЗаказПоставщикуТовары.Цена) КАК Цена,
		|	СУММА(ЗаказПоставщикуТовары.Сумма) КАК Сумма,
		|	ЗаказПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ЗаказПоставщикуТовары.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК СуммаСНДС,
		|	ЗаказПоставщикуТовары.СтатьяРасходов КАК СтатьяРасходов,
		|	ЗаказПоставщикуТовары.АналитикаРасходов КАК АналитикаРасходов,
		|	ЗаказПоставщикуТовары.Склад КАК Склад,
		|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
		|	ЗаказПоставщикуТовары.Подразделение КАК Подразделение,
		|	ЗаказПоставщикуТовары.СписатьНаРасходы КАК СписатьНаРасходы,
		|	ЗаказПоставщикуТовары.КодСтроки КАК КодСтроки
		|ПОМЕСТИТЬ втСтроки
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				втЗаказы.ДокументПоступления КАК ДокументПоступления
		|			ИЗ
		|				втЗаказы КАК втЗаказы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика,
		|	ЗаказПоставщикуТовары.Упаковка,
		|	ЗаказПоставщикуТовары.СтатьяРасходов,
		|	ЗаказПоставщикуТовары.АналитикаРасходов,
		|	ЗаказПоставщикуТовары.Склад,
		|	ЗаказПоставщикуТовары.Назначение,
		|	ЗаказПоставщикуТовары.Подразделение,
		|	ЗаказПоставщикуТовары.СписатьНаРасходы,
		|	ЗаказПоставщикуТовары.СтавкаНДС,
		|	ЗаказПоставщикуТовары.КодСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСтроки.Ссылка КАК Ссылка,
		|	втСтроки.Номенклатура КАК Номенклатура,
		|	втСтроки.Характеристика КАК Характеристика,
		|	втСтроки.Упаковка КАК Упаковка,
		|	втСтроки.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втСтроки.Количество КАК Количество,
		|	втСтроки.Цена КАК Цена,
		|	втСтроки.Сумма КАК Сумма,
		|	втСтроки.СтавкаНДС КАК СтавкаНДС,
		|	втСтроки.СуммаНДС КАК СуммаНДС,
		|	втСтроки.СуммаСНДС КАК СуммаСНДС,
		|	втСтроки.СтатьяРасходов КАК СтатьяРасходов,
		|	втСтроки.АналитикаРасходов КАК АналитикаРасходов,
		|	втСтроки.Склад КАК Склад,
		|	втСтроки.Назначение КАК Назначение,
		|	втСтроки.Подразделение КАК Подразделение,
		|	втСтроки.СписатьНаРасходы КАК СписатьНаРасходы,
		|	втЗаказы.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерам,
		|	втЗаказы.КОформлениюОрдеровОстаток КАК КОформлениюОрдеров,
		|	втЗаказы.Серия КАК Серия,
		|	втСтроки.КодСтроки КАК КодСтроки
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтроки КАК втСтроки
		|		ПО втЗаказы.ДокументПоступления = втСтроки.Ссылка
		|			И втЗаказы.Номенклатура = втСтроки.Номенклатура
		|			И втЗаказы.Характеристика = втСтроки.Характеристика
		|			И втЗаказы.Назначение = втСтроки.Назначение
		|			И втЗаказы.Склад = втСтроки.Склад
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
	
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
		Запрос.УстановитьПараметр("ДокументПоступления", ДокументПоступления);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления", "");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		НовДок = Документы.ПриемкаТоваровНаХранение.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(НовДок, ВыборкаЗаказ.Ссылка,,"Номер, Проведен");
		НовДок.Дата = ТекущаяДата();
		НовДок.ЗаказПоставщику = ВыборкаЗаказ.Ссылка;
		НовДок.ПоступлениеПоЗаказам = Истина;
		
		//НовДок.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
		НовДок.Валюта = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		//НовДок.ВалютаВзаиморасчетов = ВыборкаЗаказ.Ссылка.Договор.БанковскийСчет.ВалютаДенежныхСредств;
		НовДок.ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.НайтиПоНаименованию("",,,НовДок.Партнер);
		Выборка = ВыборкаЗаказ.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтрока = НовДок.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
			НовСтрока.ЗаказПоставщику = ВыборкаЗаказ.Ссылка;
			
			Если ЗначениеЗаполнено(НовСтрока.Серия) Тогда
				НовСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
			КвоФакт = Выборка.КОформлениюПоступленийПоОрдерам - Выборка.КОформлениюОрдеров;
			
			Если Не КвоФакт = НовСтрока.КоличествоУпаковок Тогда
				НовСтрока.Количество = КвоФакт;
				НовСтрока.КоличествоУпаковок = КвоФакт;
				НовСтрока.Сумма = Окр(Выборка.Сумма * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаСНДС = Окр(Выборка.СуммаСНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
				НовСтрока.СуммаНДС = Окр(Выборка.СуммаНДС * КвоФакт / Выборка.КоличествоУпаковок,2);
			КонецЕсли;
			
		КонецЦикла;
		НовДок.Записать(РежимЗаписиДокумента.Запись);
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьДокументы(Документ = Неопределено) Экспорт
	ОбработатьЗаказыКлиента(Документ);
	ОбработатьЗаказыПоставщика(Документ);
	ОбработатьЗаказыПоставщика_ТоварыВПути(Документ);
	ОбработатьЗаказыПоставщика_Хранение(Документ);
КонецПроцедуры
//-->АГ:[УСЛ0017]
